qodome/Firmware/IM14BEA/nRF51822/ble_app_ecg/main.c
        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISEMENT)
            {
                // FIXME
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);

    ble_ecg_on_ble_evt(&m_ecg, p_ble_evt);
    ble_bas_on_ble_evt(&m_bas, p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_8000MS_CALIBRATION, false);

    // Enable BLE stack 
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
    
    // Register with the SoftDevice handler module for sys events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

static void ecg_do_spi_rx(void * p_event_data, uint16_t event_size);

void ecg_gpiote_event_handler(uint32_t event_pins_low_to_high, uint32_t event_pins_high_to_low)
{
    if (event_pins_low_to_high & 0x400) {
    	app_sched_event_put(NULL, 0, ecg_do_spi_rx);
    }
}

/**@brief Function for initializing the GPIOTE handler module.
 */
static void gpiote_init(void)
{
    uint32_t low_to_high_bitmask = 0x00000400; // Bitmask to be notified of transition from low to high for GPIO 10
    uint32_t high_to_low_bitmask = 0x00000000; // don't care
    uint32_t retval;

    nrf_gpio_pin_dir_set(10, NRF_GPIO_PIN_DIR_INPUT);

    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);

    retval = app_gpiote_user_register(&m_gpio_uid, low_to_high_bitmask, high_to_low_bitmask, ecg_gpiote_event_handler);
    APP_ERROR_CHECK(retval);

    retval = app_gpiote_user_enable(m_gpio_uid);
    APP_ERROR_CHECK(retval);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

static void acc_spi_init(void)
{
    spi_master_config_t spi_config = SPI_MASTER_INIT_DEFAULT;

    //Configure SPI master.
    spi_config.SPI_Pin_SCK = 30;
    spi_config.SPI_Pin_MISO = 27;
    spi_config.SPI_Pin_MOSI = 29;
    spi_config.SPI_Pin_SS = 26;
    spi_config.SPI_CONFIG_ORDER = SPI_CONFIG_ORDER_MsbFirst;

    //Initialize SPI master.
    uint32_t err_code = spi_master_open(SPI_MASTER_0, &spi_config);
    APP_ERROR_CHECK(err_code);
}

static void ecg_spi_init(void)
{
    spi_master_config_t spi_config = SPI_MASTER_INIT_DEFAULT;

    //Configure SPI master.
    spi_config.SPI_Pin_SCK = 13;
    spi_config.SPI_Pin_MISO = 11;
    spi_config.SPI_Pin_MOSI = 12;
    spi_config.SPI_Pin_SS = 16;
    spi_config.SPI_CONFIG_CPHA = SPI_CONFIG_CPHA_Trailing;
    spi_config.SPI_CONFIG_ORDER = SPI_CONFIG_ORDER_MsbFirst;
    spi_config.SPI_Freq = SPI_FREQUENCY_FREQUENCY_M1;

    //Initialize SPI master.
    uint32_t err_code = spi_master_open(SPI_MASTER_1, &spi_config);
    APP_ERROR_CHECK(err_code);
}

static void ecg_do_spi_rx(void * p_event_data, uint16_t event_size)
{
    ble_ecg_v_t ecg_v;
    uint32_t err_code;

    spi_master_send_recv(SPI_MASTER_1, NULL, 0, ecg_rx_buffer, ECG_BUFFER_SIZE);

    if (ecg_notify_on) {
        memcpy((uint8_t *)&ecg_v, ecg_rx_buffer, sizeof(ble_ecg_v_t));
        err_code = ble_ecg_v_send(&m_ecg, &ecg_v);
        switch (err_code)
        {
            case NRF_SUCCESS:
                break;

            case NRF_ERROR_INVALID_STATE:
                // Ignore error.
                break;

            default:
                APP_ERROR_HANDLER(err_code);
                break;
        }
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize
    timers_init();
    ble_stack_init();

    // ACC/ECG SPI
    acc_spi_init();
    ecg_spi_init();

    // PIC interrupt
    gpiote_init();

    scheduler_init();    
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

    // Start execution
    advertising_start();

    // Enter main loop
    for (;;)
    {
        app_sched_execute();
        power_manage();
    }
}

/**
 * @}
 */
